tap "anomalyco/tap"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae", trusted: true
tap "jurplel/tap", trusted: true
tap "nikitabobko/tap", trusted: true
tap "rjyo/moshi", trusted: true
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Incredibly fast JavaScript runtime, bundler, test runner, and package manager
brew "bun"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Next-gen compiler infrastructure
brew "llvm"
# Deep clean and optimize your Mac
brew "mole"
# Remote terminal application
brew "mosh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Ruby version manager
brew "rbenv"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode", trusted: true
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Portable daemon + CLI that bridges AI coding agents to the Moshi mobile app
brew "rjyo/moshi/moshi-hook"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Enable Windows-like alt-tab
cask "alt-tab"
# Memory training application
cask "anki"
# Terminal interface for Antigravity agents
cask "antigravity-cli"
# Display management tool
cask "betterdisplay"
cask "font-departure-mono"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source media player
cask "iina"
# Native instant workspace switching
cask "jurplel/tap/instant-space-switcher"
# Menu bar manager
cask "jordanbaird-ice"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
vscode "adpyke.codesnap"
vscode "biomejs.biome"
vscode "charliermarsh.ruff"
vscode "dracula-theme.theme-dracula"
vscode "esbenp.prettier-vscode"
vscode "james-yu.latex-workshop"
vscode "jasew.anki"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "mshr-h.veriloghdl"
vscode "pkief.material-icon-theme"
vscode "tamasfe.even-better-toml"
vscode "vadimcn.vscode-lldb"
vscode "violetbp.lc2k"
