# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Next-gen compiler infrastructure
brew "llvm"
# Ruby version manager
brew "rbenv"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Display management tool
cask "betterdisplay"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source media player
cask "iina"
# Menu bar manager
cask "jordanbaird-ice"
vscode "adpyke.codesnap"
vscode "dracula-theme.theme-dracula"
vscode "esbenp.prettier-vscode"
vscode "james-yu.latex-workshop"
vscode "jasew.anki"
vscode "ms-vscode.cpptools"
vscode "pkief.material-icon-theme"
vscode "vadimcn.vscode-lldb"
vscode "violetbp.lc2k"
