[
  "obsidian-style-settings",
  "templater-obsidian",
  "calendar",
  "widgets",
  "periodic-notes",
  "omnisearch",
  "obsidian-to-anki-plugin",
  "obsidian-kanban",
  "obsifetch",
  "always-color-text"
]